{
  "_name_or_path": "./model/model_mistral_100M",
  "architectures": [
    "MistralForCausalLM"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_mistral.MistralConfig",
    "AutoModel": "modeling_mistral.MistralModel",
    "AutoModelForCausalLM": "modeling_mistral.MistralForCausalLM",
    "AutoModelForMaskedLM": "modeling_mistral.MistralForMaskedLM",
    "AutoModelForSequenceClassification": "modeling_mistral.MistralForSequenceClassification"
  },
  "bos_token_id": 1,
  "classifier_dropout": 0.1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_causal": true,
  "max_position_embeddings": 32768,
  "model_type": "mistral",
  "num_attention_heads": 8,
  "num_hidden_layers": 12,
  "num_key_value_heads": 8,
  "output_router_logits": false,
  "pad_token_id": 3,
  "rms_norm_eps": 1e-05,
  "rope_theta": 1000000.0,
  "router_aux_loss_coef": 0.02,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.38.2",
  "use_cache": true,
  "vocab_size": 4096
}
