{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "A": 5,
      "C": 6,
      "G": 7,
      "N": 8,
      "T": 9,
      "CG": 10,
      "CA": 11,
      "TG": 12,
      "AA": 13,
      "TT": 14,
      "AG": 15,
      "CC": 16,
      "CGG": 17,
      "CT": 18,
      "AT": 19,
      "CAG": 20,
      "TGG": 21,
      "CCG": 22,
      "CCA": 23,
      "CTG": 24,
      "TCG": 25,
      "CTT": 26,
      "AAG": 27,
      "AGG": 28,
      "ACG": 29,
      "ATT": 30,
      "ATG": 31,
      "CCGG": 32,
      "TTG": 33,
      "ACA": 34,
      "TCA": 35,
      "CAGG": 36,
      "CGCG": 37,
      "CGGG": 38,
      "CTGG": 39,
      "TAA": 40,
      "ACC": 41,
      "CTCG": 42,
      "CCAG": 43,
      "TCC": 44,
      "TAG": 45,
      "GG": 46,
      "AAAA": 47,
      "ACT": 48,
      "TAT": 49,
      "TCT": 50,
      "ATGG": 51,
      "CGGCG": 52,
      "CCCG": 53,
      "TTTT": 54,
      "ATCG": 55,
      "CCTG": 56,
      "ACCG": 57,
      "TCGG": 58,
      "CACG": 59,
      "TTGG": 60,
      "CTTG": 61,
      "ACGG": 62,
      "CAAG": 63,
      "CAAA": 64,
      "AAGG": 65,
      "ACCA": 66,
      "AGCG": 67,
      "TCCG": 68,
      "TGGG": 69,
      "CATG": 70,
      "TTCG": 71,
      "ATTG": 72,
      "ACTT": 73,
      "TCTT": 74,
      "TCCA": 75,
      "ACAG": 76,
      "TTTG": 77,
      "TATT": 78,
      "ATCA": 79,
      "ATAA": 80,
      "AGGG": 81,
      "TCAG": 82,
      "CCAGG": 83,
      "CCGCG": 84,
      "AGAA": 85,
      "ACTG": 86,
      "TGCG": 87,
      "CTCA": 88,
      "CCTT": 89,
      "CCCA": 90,
      "CCGGG": 91,
      "TCTG": 92,
      "TGAA": 93,
      "AGCA": 94,
      "TTCA": 95,
      "CCTCG": 96,
      "TACA": 97,
      "AACG": 98,
      "AATT": 99,
      "AAAG": 100,
      "TACG": 101,
      "CAGCG": 102,
      "CGGGG": 103,
      "TATG": 104,
      "AGAG": 105,
      "CCCGG": 106,
      "CCTGG": 107,
      "AATG": 108,
      "TAGG": 109,
      "CGAG": 110,
      "ATCT": 111,
      "CATT": 112,
      "ATAG": 113,
      "CTGGG": 114,
      "TAAG": 115,
      "CACA": 116,
      "CCGCCG": 117,
      "ACCGG": 118,
      "TGTG": 119,
      "CTCT": 120,
      "TCGCG": 121,
      "TGGCG": 122,
      "CAGGG": 123,
      "CTGCG": 124,
      "AACA": 125,
      "CTCGG": 126,
      "CCGAG": 127,
      "TGAG": 128,
      "CTTCG": 129,
      "TGCA": 130,
      "AAAT": 131,
      "ATTTT": 132,
      "TGTT": 133,
      "CCACG": 134,
      "CCGGCG": 135,
      "CCT": 136,
      "CCCT": 137,
      "CGGCA": 138,
      "ACCAG": 139,
      "CCTTG": 140,
      "ATAT": 141,
      "ACGCG": 142,
      "AGTT": 143,
      "AGGCG": 144,
      "CGGTG": 145,
      "TCGAG": 146,
      "TCGGG": 147,
      "CCCAG": 148,
      "CCCCG": 149,
      "TACC": 150,
      "GGG": 151,
      "CGGCGG": 152,
      "ACGGG": 153,
      "ACTGG": 154,
      "TCCGG": 155,
      "TGCCG": 156,
      "TACT": 157,
      "TGAT": 158,
      "CAGCA": 159,
      "CGCA": 160,
      "CCCTG": 161,
      "CTAA": 162,
      "CCGCA": 163,
      "TCCAG": 164,
      "CTTTT": 165,
      "CGCGCG": 166,
      "TGCTG": 167,
      "CCTCA": 168,
      "ACGAG": 169,
      "CTTCA": 170,
      "ATATT": 171,
      "TCTCG": 172,
      "ACAGG": 173,
      "TGCT": 174,
      "AAATT": 175,
      "ATGGG": 176,
      "TCTGG": 177,
      "TCAGG": 178,
      "ATGCG": 179,
      "AAGCG": 180,
      "ACTCG": 181,
      "CCTCC": 182,
      "TCGGCG": 183,
      "CCAAG": 184,
      "CATCG": 185,
      "ATCGG": 186,
      "CTTGG": 187,
      "TTAA": 188,
      "CCGTG": 189,
      "AAGAA": 190,
      "ATCAG": 191,
      "CCCC": 192,
      "CGGAG": 193,
      "TGATG": 194,
      "AAGGG": 195,
      "ACCCG": 196,
      "ACGGCG": 197,
      "ATCTG": 198,
      "AGGAG": 199,
      "TGGGG": 200,
      "CTAG": 201,
      "TCACG": 202,
      "CCATG": 203,
      "CCGAA": 204,
      "CGGGCG": 205,
      "TAAAA": 206,
      "CCAAA": 207,
      "TCCCG": 208,
      "ATTGG": 209,
      "CTGCA": 210,
      "TTGGG": 211,
      "CCCGCG": 212,
      "TTGCG": 213,
      "CTCCG": 214,
      "TCGCCG": 215,
      "CGGCCG": 216,
      "ATCCG": 217,
      "ATCTT": 218,
      "TGGTG": 219,
      "ATGAA": 220,
      "TTTTG": 221,
      "AAGAG": 222,
      "CTCCA": 223,
      "ACCTG": 224,
      "CCCCA": 225,
      "AGGGG": 226,
      "CCAGCG": 227,
      "ACAAG": 228,
      "ACAAA": 229,
      "CATCA": 230,
      "TGGAG": 231,
      "TTCT": 232,
      "ATTCG": 233,
      "ACACG": 234,
      "TCGTCG": 235,
      "CTTTG": 236,
      "ATCCA": 237,
      "CCGACG": 238,
      "CTGGCG": 239,
      "TTAG": 240,
      "CTCC": 241,
      "TGAAG": 242,
      "CGGAA": 243,
      "TGACG": 244,
      "ATGAG": 245,
      "TTTCA": 246,
      "TCGAA": 247,
      "TGCAG": 248,
      "CACCG": 249,
      "AGGAA": 250,
      "TTGAA": 251,
      "CCAGGG": 252,
      "TACTT": 253,
      "TGGAA": 254,
      "CTGCTG": 255,
      "CAAT": 256,
      "CTCTT": 257,
      "ACGAA": 258,
      "TGCGG": 259,
      "CTCAG": 260,
      "TCAAG": 261,
      "TAATT": 262,
      "CTGAA": 263,
      "CTCGCG": 264,
      "ACCGCG": 265,
      "CCCTT": 266,
      "TCAAA": 267,
      "CCGGGG": 268,
      "ATCGCG": 269,
      "CAAGG": 270,
      "TGTTG": 271,
      "TCGACG": 272,
      "AAAAAA": 273,
      "CAGAA": 274,
      "CCATT": 275,
      "TGGCA": 276,
      "TATCG": 277,
      "CAGGCG": 278,
      "CCGCGG": 279,
      "CTGAG": 280,
      "ATCC": 281,
      "ATTTG": 282,
      "AAGTT": 283,
      "CCGTCG": 284,
      "CAACG": 285,
      "TACCA": 286,
      "CAGAG": 287,
      "CAACA": 288,
      "TTGAG": 289,
      "TGTCG": 290,
      "TATGG": 291,
      "ATTAA": 292,
      "CACCA": 293,
      "ACGACG": 294,
      "CTCTG": 295,
      "TACAG": 296,
      "ATGTT": 297,
      "CCGAGG": 298,
      "CAGCAG": 299,
      "TAAAG": 300,
      "CCTCGG": 301,
      "CAAAG": 302,
      "TACCG": 303,
      "TCCTG": 304,
      "TACTG": 305,
      "TCTTG": 306,
      "CCGTT": 307,
      "CGAA": 308,
      "ACATT": 309,
      "CCCTCG": 310,
      "CGGTCG": 311,
      "TTGTT": 312,
      "CCTTCG": 313,
      "ACCTT": 314,
      "CCGCCA": 315,
      "TACGG": 316,
      "CTACG": 317,
      "CTGTT": 318,
      "ACCAGG": 319,
      "ATGGCG": 320,
      "AGGTG": 321,
      "CATGG": 322,
      "ATATG": 323,
      "CAATT": 324,
      "CTATT": 325,
      "TCGTG": 326,
      "CCTGCG": 327,
      "TCATT": 328,
      "TCCGCG": 329,
      "CGGTT": 330,
      "CATTG": 331,
      "CAATG": 332,
      "CTAT": 333,
      "TTTTTT": 334,
      "CGCGAG": 335,
      "TCGAGG": 336,
      "TAGCG": 337,
      "AAGGCG": 338,
      "TCCTT": 339,
      "CCCTGG": 340,
      "CAGTT": 341,
      "TGGGCG": 342,
      "TGGTT": 343,
      "CCTCT": 344,
      "CTACA": 345,
      "ATAAAA": 346,
      "CCGCTG": 347,
      "CTCGAG": 348,
      "CACGG": 349,
      "TATAA": 350,
      "CCATCG": 351,
      "AAGAAG": 352,
      "ATACA": 353,
      "CCCGGG": 354,
      "AGTG": 355,
      "CCCAGG": 356,
      "ACCGGG": 357,
      "CCCCGG": 358,
      "ACGCCG": 359,
      "ATCTCG": 360,
      "ACTTG": 361,
      "CCGATG": 362,
      "TATTG": 363,
      "TCATG": 364,
      "TAGAA": 365,
      "AGGGCG": 366,
      "ACCTCG": 367,
      "ACGTG": 368,
      "AAGCA": 369,
      "CGGTGG": 370,
      "TTGGCG": 371,
      "CGGCTG": 372,
      "CGGCAG": 373,
      "ATCGAG": 374,
      "CCACA": 375,
      "TAGAG": 376,
      "CGGCCA": 377,
      "CCGGAG": 378,
      "AGGTT": 379,
      "TCCAGG": 380,
      "TCGTT": 381,
      "ATTCA": 382,
      "CCTCCG": 383,
      "ACATG": 384,
      "ATAAG": 385,
      "CGGGGG": 386,
      "TCAGCG": 387,
      "TCTTCG": 388,
      "TAAGG": 389,
      "TCCTCG": 390,
      "CCCGAG": 391,
      "CTATG": 392,
      "CGGCGCG": 393,
      "ATCCGG": 394,
      "CTGCCG": 395,
      "CCTGGG": 396,
      "ATACG": 397,
      "TGGTGG": 398,
      "AAGTG": 399,
      "TCGATG": 400,
      "CCTTGG": 401,
      "AAAATT": 402,
      "CAGTG": 403,
      "CCACCA": 404,
      "CCGGCA": 405,
      "CCGGTG": 406,
      "ACCTGG": 407,
      "CTCGGG": 408,
      "ATGATG": 409,
      "ATCAGG": 410,
      "ACGAGG": 411,
      "TCGGGG": 412,
      "AAAAAG": 413,
      "TCCGGG": 414,
      "CCCACG": 415,
      "TTGCA": 416,
      "CCGAAG": 417,
      "CTGGGG": 418,
      "ACCCA": 419,
      "TATCA": 420,
      "ATGCA": 421,
      "TAATG": 422,
      "AGGCA": 423,
      "ACGTT": 424,
      "AGCAG": 425,
      "AAAAG": 426,
      "TAGGG": 427,
      "CTGTG": 428,
      "CCGCAG": 429,
      "CCTCCA": 430,
      "TCATCG": 431,
      "TATTTT": 432,
      "TCCCA": 433,
      "ATCTGG": 434,
      "CTTCTT": 435,
      "TAACG": 436,
      "CAAGCG": 437,
      "ATGTG": 438,
      "CGGCT": 439,
      "CCCTTG": 440,
      "CCGCT": 441,
      "ATTTTG": 442,
      "TAGTT": 443,
      "ATCACG": 444,
      "ACCACG": 445,
      "CCATCA": 446,
      "AGAAG": 447,
      "AGGAGG": 448,
      "TCGCGG": 449,
      "TCGCA": 450,
      "AGCTG": 451,
      "ACTTCG": 452,
      "CCGTGG": 453,
      "ACGCA": 454,
      "ATTATT": 455,
      "CCTAA": 456,
      "ATCCCG": 457,
      "TCATCA": 458,
      "CTTGCG": 459,
      "ATCAAA": 460,
      "CCAGCA": 461,
      "CTCGGCG": 462,
      "ATAGG": 463,
      "TTGTG": 464,
      "AATAA": 465,
      "ACAGCG": 466,
      "ACGTCG": 467,
      "CCTTTG": 468,
      "CCCATG": 469,
      "CAGCGG": 470,
      "ACGATG": 471,
      "CCCCCG": 472,
      "ATCGGG": 473,
      "CCACCG": 474,
      "TGGCGG": 475,
      "CCTAT": 476,
      "CCTTTT": 477,
      "ACTCA": 478,
      "CTCCGG": 479,
      "TTCTT": 480,
      "ATTTAA": 481,
      "ACGGGG": 482,
      "AGCGG": 483,
      "CTCCAG": 484,
      "ATCTTG": 485,
      "TCTCA": 486,
      "CCAAGG": 487,
      "ATGAAG": 488,
      "CCCGGCG": 489,
      "TCCTGG": 490,
      "TGAGG": 491,
      "ACTAA": 492,
      "ATTAG": 493,
      "CAGCCG": 494,
      "CTGGAG": 495,
      "TCCACG": 496,
      "ACATCG": 497,
      "CTTAA": 498,
      "TATAG": 499,
      "ATCAAG": 500,
      "ATCCTG": 501,
      "TTGTTG": 502,
      "ATCCAG": 503,
      "CTGCGG": 504,
      "ATGCCG": 505,
      "CTCCTG": 506,
      "TAATAA": 507,
      "ACTGGG": 508,
      "TCGAAG": 509,
      "CTCTCG": 510,
      "CAGGGG": 511,
      "TGGCCG": 512,
      "ATATTG": 513,
      "ATTTTTT": 514,
      "CCCCAG": 515,
      "TCTAA": 516,
      "ATTTCA": 517,
      "ACGAAG": 518,
      "CTGCAG": 519,
      "ACGCGG": 520,
      "TTCGG": 521,
      "TTTCG": 522,
      "CCGCCGG": 523,
      "TGCCA": 524,
      "ATCATG": 525,
      "ACCTTG": 526,
      "ACACA": 527,
      "ACATCA": 528,
      "CCGCGCG": 529,
      "ATAATT": 530,
      "AATTG": 531,
      "CTCAAG": 532,
      "TCTGCG": 533,
      "TCCTTG": 534,
      "ATACT": 535,
      "AAATG": 536,
      "AGGCGG": 537,
      "CAGGAG": 538,
      "ACCCGG": 539,
      "CTTTTG": 540,
      "CTGAAG": 541,
      "CCGGGCG": 542,
      "TTTGG": 543,
      "CTACT": 544,
      "TGCGCG": 545,
      "CGGCGAG": 546,
      "CAAAAG": 547,
      "CTGATG": 548,
      "CCGGAA": 549,
      "TGTGG": 550,
      "CCATGG": 551,
      "CCTCTT": 552,
      "ATGGGG": 553,
      "TCGGCA": 554,
      "AGGTCG": 555,
      "CATGCG": 556,
      "ACAACA": 557,
      "CTCCCG": 558,
      "CTTCGG": 559,
      "TTCCA": 560,
      "CCGTCA": 561,
      "AGGAAG": 562,
      "TCTGGG": 563,
      "CCGTTG": 564,
      "CGCGCA": 565,
      "CTCACG": 566,
      "CCGGCGG": 567,
      "CCGACA": 568,
      "CCCAAG": 569,
      "CTGGAA": 570,
      "TGGTCG": 571,
      "ACCGAG": 572,
      "ACGCTG": 573,
      "CGCGAA": 574,
      "CTCGAA": 575,
      "AGCGAG": 576,
      "TCACA": 577,
      "TAGCA": 578,
      "CTCTTG": 579,
      "TCAGGG": 580,
      "CTGGTG": 581,
      "CAGGAA": 582,
      "ACGGCA": 583,
      "TTCAG": 584,
      "TTTAA": 585,
      "TTGGGG": 586,
      "TTGATG": 587,
      "CTAAG": 588,
      "TGATT": 589,
      "TTGAAG": 590,
      "CCCCTG": 591,
      "CCACGG": 592,
      "CCTACG": 593,
      "CCAAAG": 594,
      "CCTAG": 595,
      "CACGAG": 596,
      "CAAACG": 597,
      "CGGGAG": 598,
      "CAGAAG": 599,
      "ACAGGG": 600,
      "TACCGG": 601,
      "TTCGAG": 602,
      "ATTGCG": 603,
      "AGGCCG": 604,
      "TAACA": 605,
      "TGCTT": 606,
      "ATCGAA": 607,
      "CCAACG": 608,
      "TTTTCG": 609,
      "CTCTGG": 610,
      "CTACC": 611,
      "CAGCTG": 612,
      "ACTGCG": 613,
      "TGCTCG": 614,
      "ATACC": 615,
      "ATATAA": 616,
      "CGGACG": 617,
      "CCTTCA": 618,
      "TAAATT": 619,
      "CCAACA": 620,
      "CCATTG": 621,
      "TCGCTG": 622,
      "AAGGAG": 623,
      "CGGGCA": 624,
      "CAGCGCG": 625,
      "CCCGCA": 626,
      "ATGGAG": 627,
      "TTCTG": 628,
      "TCCCGG": 629,
      "ATGTCG": 630,
      "CTAAAA": 631,
      "ATGCTG": 632,
      "CTTTCA": 633,
      "TGGAAG": 634,
      "AGAACG": 635,
      "CCCAAA": 636,
      "AAACA": 637,
      "TCGGTG": 638,
      "TGAACG": 639,
      "CGGAAG": 640,
      "CCTCTG": 641,
      "AATCG": 642,
      "CTTAG": 643,
      "CTCGCCG": 644,
      "AAAACG": 645,
      "TACTGG": 646,
      "AATGG": 647,
      "TAGGCG": 648,
      "TTATT": 649,
      "TTCCG": 650,
      "CTCAGG": 651,
      "CGGTCA": 652,
      "TGACA": 653,
      "CGCGCCG": 654,
      "ATCGGCG": 655,
      "CTCATG": 656,
      "CTCAAA": 657,
      "AATCA": 658,
      "TACCAG": 659,
      "ATGACG": 660,
      "AGAAAG": 661,
      "ACCTCA": 662,
      "ATAAAG": 663,
      "TCTAG": 664,
      "ATATCG": 665,
      "CTTTGG": 666,
      "ATGTTG": 667,
      "CCTGCA": 668,
      "CTTCAG": 669,
      "CGGAGG": 670,
      "CCCTCA": 671,
      "CCTCAG": 672,
      "CTCGACG": 673,
      "CTGGGCG": 674,
      "TCCTCA": 675,
      "TGTCA": 676,
      "CTGTTG": 677,
      "ATTTCG": 678,
      "CTGACG": 679,
      "TTTGCG": 680,
      "TGTAG": 681,
      "TACTCG": 682,
      "AGGACG": 683,
      "TCGGAG": 684,
      "TGCCGG": 685,
      "AACAG": 686,
      "ATGCGG": 687,
      "CTTTCG": 688,
      "AGGTGG": 689,
      "CTTGGG": 690,
      "CTTCCA": 691,
      "TCTTTT": 692,
      "CCAGAA": 693,
      "CCAGGCG": 694,
      "ACAAAG": 695,
      "CCAGAG": 696,
      "TTGCCG": 697,
      "CTGTCG": 698,
      "CTGCGCG": 699,
      "TGCTGG": 700,
      "ACTAG": 701,
      "CTTGAG": 702,
      "TATATT": 703,
      "CGGCCGG": 704,
      "ACAAGG": 705,
      "TAAAAG": 706,
      "TAAAAAA": 707,
      "CCTCGCG": 708,
      "AAAGG": 709,
      "TGATCG": 710,
      "CCTACA": 711,
      "ACCAAG": 712,
      "CAGCCA": 713,
      "ACCGGCG": 714,
      "CTTCT": 715,
      "ACTTTT": 716,
      "TACGCG": 717,
      "CTTCTG": 718,
      "TCGCCA": 719,
      "TCTTCA": 720,
      "ATATCA": 721,
      "CGGCGGCG": 722,
      "CGGATG": 723,
      "CCGGCCG": 724,
      "CAAGAA": 725,
      "CTCGTCG": 726,
      "CGGCGGG": 727,
      "CCCGAA": 728,
      "CAGATG": 729,
      "ATTGAA": 730,
      "ACGCCA": 731,
      "ATTGGG": 732,
      "ATGGAA": 733,
      "ACGACA": 734,
      "CCCCCA": 735,
      "TTTTTG": 736,
      "TCTTGG": 737,
      "ACGTGG": 738,
      "ACGGAG": 739,
      "CTGCCA": 740,
      "CAAGAG": 741,
      "TACAGG": 742,
      "TCGTCA": 743,
      "CTGCTCG": 744,
      "ATCTCA": 745,
      "AAGCCG": 746,
      "AGCGCA": 747,
      "CCGCGAG": 748,
      "TTTTCA": 749,
      "TAGTG": 750,
      "CTAGG": 751,
      "CAAATT": 752,
      "TCGTGG": 753,
      "TTTTAA": 754,
      "TCCGAG": 755,
      "TATTCG": 756,
      "ATTTGG": 757,
      "CAGGGCG": 758,
      "ACCGCA": 759,
      "TCAGCA": 760,
      "CGGGAA": 761,
      "CTTCCG": 762,
      "TTGGAG": 763,
      "TAGAAG": 764,
      "CCTGGCG": 765,
      "AAGGAA": 766,
      "CAGCT": 767,
      "AAAACA": 768,
      "AGGATG": 769,
      "TTCGCG": 770,
      "TTGCTG": 771,
      "TCACCG": 772,
      "ATGGCA": 773,
      "TCTCGG": 774,
      "CTGGCA": 775,
      "ACGGTG": 776,
      "CTTTAA": 777,
      "ACCCCG": 778,
      "CCAATG": 779,
      "CGGGGCG": 780,
      "CTTGAA": 781,
      "CCCGCCG": 782,
      "ACATGG": 783,
      "AAGATG": 784,
      "TCCCAG": 785,
      "TCCGGCG": 786,
      "TTTCT": 787,
      "ACTTCA": 788,
      "CTGCT": 789,
      "CGGCTT": 790,
      "ATGGTG": 791,
      "ATACCA": 792,
      "CGGTTG": 793,
      "ATAGAA": 794,
      "CCTATG": 795,
      "ACCCAG": 796,
      "TTTGAA": 797,
      "ATCGTG": 798,
      "TCTCCA": 799,
      "ACAGCA": 800,
      "AAAATG": 801,
      "CCTGAA": 802,
      "ACATTG": 803,
      "CGGGTG": 804,
      "AGGGGG": 805,
      "ATCATT": 806,
      "CAGTTG": 807,
      "TGAAAG": 808,
      "ACAATT": 809,
      "ATACTT": 810,
      "CACGAA": 811,
      "CCCAGCG": 812,
      "ATCGCCG": 813,
      "ATACCG": 814,
      "CCTGAG": 815,
      "TCGTTG": 816,
      "CTGCTGG": 817,
      "ATCCCA": 818,
      "ATGATT": 819,
      "TACGGG": 820,
      "AAAAATT": 821,
      "ACGTCA": 822,
      "ACGTTG": 823,
      "CAGGTG": 824,
      "ATTGAG": 825,
      "CAGCTT": 826,
      "TGGTCA": 827,
      "TGGGGG": 828,
      "CTCCTCG": 829,
      "TGGATG": 830,
      "TGGCTG": 831,
      "ACCAAA": 832,
      "CAGGCA": 833,
      "TCCGCA": 834,
      "CCAATT": 835,
      "CTCCTT": 836,
      "TGGAGG": 837,
      "ATCGCA": 838,
      "ATATGG": 839,
      "AAGCTG": 840,
      "TGCGAG": 841,
      "TAATTG": 842,
      "CGCGTG": 843,
      "TGGGAG": 844,
      "CTTTTTT": 845,
      "ACAACG": 846,
      "CTGGCCG": 847,
      "AGGTCA": 848,
      "ACACCG": 849,
      "AGGTTG": 850,
      "TCCAAG": 851,
      "AAGGCA": 852,
      "TCCCCG": 853,
      "TGGACG": 854,
      "CCGGTT": 855,
      "TGGCCA": 856,
      "CATGAA": 857,
      "TAGCCG": 858,
      "TCAAAG": 859,
      "TCTCCG": 860,
      "TCGGCGG": 861,
      "CAGACG": 862,
      "TTGGAA": 863,
      "TGCGCA": 864,
      "ACACCA": 865,
      "CAAGCA": 866,
      "ATTTAT": 867,
      "CCTCGGCG": 868,
      "ACAATG": 869,
      "CAGCAGG": 870,
      "ACCCTG": 871,
      "AAGGGG": 872,
      "CAGCTCG": 873,
      "TCCTCC": 874,
      "CCCGTG": 875,
      "ATATTTT": 876,
      "CGGCTCG": 877,
      "CGCGACG": 878,
      "CATGAG": 879,
      "ATACTG": 880,
      "AGCGTG": 881,
      "CCTATT": 882,
      "CCAGTT": 883,
      "AAGGTG": 884,
      "TGGTTG": 885,
      "TAGATG": 886,
      "CAAACA": 887,
      "AAGCGG": 888,
      "TCCAAA": 889,
      "CAGTCG": 890,
      "ATCCTT": 891,
      "AAAATAA": 892,
      "AAGTTG": 893,
      "TTTAT": 894,
      "CCGCTCG": 895,
      "TAGTTG": 896,
      "AACGAG": 897,
      "CCCCTT": 898,
      "AGGGAG": 899,
      "TTTGAG": 900,
      "AAGACG": 901,
      "CGCGCGG": 902,
      "CTCCCA": 903,
      "CTACCG": 904,
      "CCGCTT": 905,
      "TGGCAG": 906,
      "CCGGTCG": 907,
      "TCAAGG": 908,
      "CTATTG": 909,
      "CACGCCG": 910,
      "ATCAGCG": 911,
      "TAAATG": 912,
      "TCACCA": 913,
      "AAGAGG": 914,
      "ATTCTT": 915,
      "ATACAG": 916,
      "TGGGCA": 917,
      "CGGGCGG": 918,
      "AGAATT": 919,
      "ACTTGG": 920,
      "AAGTCG": 921,
      "TATTAA": 922,
      "CCGGCGCG": 923,
      "ACCGTG": 924,
      "TACCCG": 925,
      "CCCCGCG": 926,
      "TACACG": 927,
      "GGCG": 928,
      "CACGCA": 929,
      "CTGCTT": 930,
      "CCGCCCG": 931,
      "AAGATT": 932,
      "TCATTG": 933,
      "CCCTCGG": 934,
      "ACGGAA": 935,
      "AAAGAG": 936,
      "TAGTAG": 937,
      "AGCGAA": 938,
      "TTGGCA": 939,
      "TTGGTG": 940,
      "ACCAGCG": 941,
      "AGGGCA": 942,
      "ATTGTT": 943,
      "CGCGTCG": 944,
      "ATGAGG": 945,
      "CTCGCA": 946,
      "TAATTTT": 947,
      "CTCGTG": 948,
      "TCTGCA": 949,
      "TCAACA": 950,
      "ACCGAA": 951,
      "ATGCAG": 952,
      "TATTGG": 953,
      "ATCCGCG": 954,
      "TCTTTG": 955,
      "ATTCCA": 956,
      "ATCGTCG": 957,
      "TTTGTT": 958,
      "CCAGCAG": 959,
      "CTACGG": 960,
      "CCTCGGG": 961,
      "AGGCCA": 962,
      "TATGGG": 963,
      "TATTTG": 964,
      "ATGCCA": 965,
      "ACTCCA": 966,
      "TCGGGCG": 967,
      "CTACTT": 968,
      "AGGCTG": 969,
      "AATTAA": 970,
      "TCGGAA": 971,
      "TAATCA": 972,
      "TCTCTT": 973,
      "AAGCAG": 974,
      "CGGCTGG": 975,
      "TTCATT": 976,
      "GGGG": 977,
      "TTTTAG": 978,
      "AAAAAAAA": 979,
      "TTCGAA": 980,
      "CGGCCAG": 981,
      "CCTGTT": 982,
      "ATAGCG": 983,
      "CAGTGG": 984,
      "TCAACG": 985,
      "ACTATT": 986,
      "ACCCCA": 987,
      "ATATAG": 988,
      "ATACGG": 989,
      "TATCTT": 990,
      "CTCCGCG": 991,
      "CTGGTT": 992,
      "TCAATT": 993,
      "TCATGG": 994,
      "CGCGCGCG": 995,
      "CTATCG": 996,
      "CCGAGCG": 997,
      "ATAACG": 998,
      "CCTCGAG": 999,
      "TCGACA": 1000,
      "CTCTCA": 1001,
      "CTGCCGG": 1002,
      "TACAAA": 1003,
      "ATTGCA": 1004,
      "CAAATG": 1005,
      "CTACCA": 1006,
      "ATAGAG": 1007,
      "TCGCCGG": 1008,
      "CTGATT": 1009,
      "ACTACA": 1010,
      "ACTCGG": 1011,
      "TTTCC": 1012,
      "CTGGCGG": 1013,
      "CTTGCA": 1014,
      "CTGTGG": 1015,
      "CTTCGCG": 1016,
      "TCTATT": 1017,
      "ATCGACG": 1018,
      "CTCGAGG": 1019,
      "ACTACG": 1020,
      "TCCATG": 1021,
      "CAGATT": 1022,
      "TCAGAA": 1023,
      "CCGCCAG": 1024,
      "TATTCA": 1025,
      "CTGGTCG": 1026,
      "CCCACA": 1027,
      "TACGAG": 1028,
      "TAGTCG": 1029,
      "CTACTG": 1030,
      "ACAGAA": 1031,
      "TTGTCG": 1032,
      "CGGCACG": 1033,
      "CTAAAG": 1034,
      "CCCTCT": 1035,
      "CCGACC": 1036,
      "CAGCACG": 1037,
      "TACAAG": 1038,
      "CTCGCGG": 1039,
      "AAAAAAG": 1040,
      "TGAATT": 1041,
      "TCCGAA": 1042,
      "ATGGTT": 1043,
      "TCTACA": 1044,
      "TAGAGG": 1045,
      "TTTGCA": 1046,
      "CAGAGG": 1047,
      "TTGATT": 1048,
      "TGGGAA": 1049,
      "CAGGTT": 1050,
      "ACCATG": 1051,
      "CTGATCG": 1052,
      "TTGACG": 1053,
      "TCCCCA": 1054,
      "ACCAGGG": 1055,
      "TAAACA": 1056,
      "AAGCCA": 1057,
      "ACAGAG": 1058,
      "CCTCCGG": 1059,
      "CGGGCCG": 1060,
      "CCAGTG": 1061,
      "TCAATG": 1062,
      "ACGGCGG": 1063,
      "TATGCG": 1064,
      "CAGCCGG": 1065,
      "ACTTTG": 1066,
      "ATAAGG": 1067,
      "CTTGTT": 1068,
      "AGAGAG": 1069,
      "CATGCA": 1070,
      "CGGGTT": 1071,
      "TCTACG": 1072,
      "CTGAGG": 1073,
      "ACCTCGG": 1074,
      "CGGCGAA": 1075,
      "AGAACA": 1076,
      "CTATCA": 1077,
      "CGCGTT": 1078,
      "CGGCCCG": 1079,
      "CAGGTCG": 1080,
      "TATCCA": 1081,
      "CCTCCAG": 1082,
      "ATCGAGG": 1083,
      "CAGGCCG": 1084,
      "CTAATT": 1085,
      "TGGATT": 1086,
      "ACGCCGG": 1087,
      "TCCAGCG": 1088,
      "CAAGTT": 1089,
      "ACTGCA": 1090,
      "TTGCGG": 1091,
      "TCAGAG": 1092,
      "CTCGATG": 1093,
      "CTTATT": 1094,
      "ATCCTCG": 1095,
      "CCCTGCG": 1096,
      "TGGGTG": 1097,
      "TCCACA": 1098,
      "TAGGGG": 1099,
      "ACGGGCG": 1100,
      "TCTGAA": 1101,
      "TTGGTT": 1102,
      "CTTGGCG": 1103,
      "CCGATT": 1104,
      "CCGCCGCG": 1105,
      "TAAGCG": 1106,
      "CTTTCT": 1107,
      "TAGATT": 1108,
      "TAGCGG": 1109,
      "ACCTCC": 1110,
      "ACCACA": 1111,
      "TCCATT": 1112,
      "TTCGTG": 1113,
      "ACGCAG": 1114,
      "ATAATG": 1115,
      "ACCATT": 1116,
      "ACGATT": 1117,
      "CTTTAT": 1118,
      "CAGCGAG": 1119,
      "ATCACA": 1120,
      "ATGTGG": 1121,
      "ATGACA": 1122,
      "ATCGTT": 1123,
      "ATATCT": 1124,
      "TCCCTG": 1125,
      "ACTCCG": 1126,
      "TCGAGCG": 1127,
      "CCAGCCG": 1128,
      "AGGATT": 1129,
      "TTGCCA": 1130,
      "CCCGTT": 1131,
      "CTACAG": 1132,
      "CGCGAGG": 1133,
      "ATAAATT": 1134,
      "TAATAT": 1135,
      "CTATGG": 1136,
      "CTGGTGG": 1137,
      "TAATAG": 1138,
      "ATAGCA": 1139,
      "CCGGGGG": 1140,
      "CGGCGCA": 1141,
      "CCTTGCG": 1142,
      "CGCGCTG": 1143,
      "AAGTGG": 1144,
      "CTCCAGG": 1145,
      "ATCCCGG": 1146,
      "CCGGTGG": 1147,
      "ATCGCGG": 1148,
      "CTCGTT": 1149,
      "ACTGAA": 1150,
      "CCCGACG": 1151,
      "TTGCAG": 1152,
      "CCGGCCA": 1153,
      "TGAACA": 1154,
      "CCTGCTG": 1155,
      "AAGGTT": 1156,
      "CGGATT": 1157,
      "TCCTCGG": 1158,
      "AGGGAA": 1159,
      "TAAAGG": 1160,
      "CTAATG": 1161,
      "CCCCCGG": 1162,
      "TAGCTG": 1163,
      "TAGACG": 1164,
      "ATGTCA": 1165,
      "ATCGGCA": 1166,
      "TTGAGG": 1167,
      "CCACTG": 1168,
      "TAAGGG": 1169,
      "TTCGCA": 1170,
      "CTCCTGG": 1171,
      "CCCATT": 1172,
      "ACAAAAA": 1173,
      "AGGGTG": 1174,
      "TATGAA": 1175,
      "CCAGCGG": 1176,
      "TTTTTTTT": 1177,
      "CCGCTGG": 1178,
      "CCGGCAG": 1179,
      "CTCATT": 1180,
      "ACCTGCG": 1181,
      "TCACGG": 1182,
      "ATAACA": 1183,
      "AAGAAAA": 1184,
      "AGCACA": 1185,
      "TATCTG": 1186,
      "ACTCTT": 1187,
      "TCGCAG": 1188,
      "ACCGCCG": 1189,
      "AGCATT": 1190,
      "CCGCGCA": 1191,
      "ATGGGCG": 1192,
      "TAAAATT": 1193,
      "CTTGCCG": 1194,
      "ATCCTGG": 1195,
      "CACGACG": 1196,
      "TCTCTG": 1197,
      "CTTCGAG": 1198,
      "TGCGAA": 1199,
      "CAGGCGG": 1200,
      "AAGACA": 1201,
      "TCCGTG": 1202,
      "TCGATT": 1203,
      "CCCGCGG": 1204,
      "TCTGAG": 1205,
      "TAAGAA": 1206,
      "TATTAG": 1207,
      "CCCTTCG": 1208,
      "AGCGCCG": 1209,
      "TGCGTG": 1210,
      "AGGACA": 1211,
      "ACTGAG": 1212,
      "ATCTTCG": 1213,
      "CTTTAG": 1214,
      "CTCGAAG": 1215,
      "CTATAA": 1216,
      "CCACAG": 1217,
      "CCCGTCG": 1218,
      "CCATCT": 1219,
      "CGGGTCG": 1220,
      "CGGCGACG": 1221,
      "CCATCC": 1222,
      "CACGTCG": 1223,
      "TCGGCCG": 1224,
      "CCCGGGG": 1225,
      "AGGCAG": 1226,
      "CCCCAGG": 1227,
      "AAAGTT": 1228,
      "ATCCAGG": 1229,
      "CCTGTG": 1230,
      "CTCTTCG": 1231,
      "CGGCGTG": 1232,
      "TTTTTTG": 1233,
      "AAGTAA": 1234,
      "AGAATG": 1235,
      "CCGGCTG": 1236,
      "CCGACGG": 1237,
      "AGCGCGG": 1238,
      "AATGAG": 1239,
      "AACGAA": 1240,
      "TAGTAA": 1241,
      "CACGTG": 1242,
      "CCCCTCG": 1243,
      "CCCAGGG": 1244,
      "TAGGAG": 1245,
      "CATGTT": 1246,
      "TATATG": 1247,
      "ACCTCT": 1248,
      "CCCCCT": 1249,
      "CGGACA": 1250,
      "CCCTGGG": 1251,
      "CGCGATG": 1252,
      "ATCCGGG": 1253,
      "TTTTTAA": 1254,
      "ATCATCG": 1255,
      "CCCCGGG": 1256,
      "CCGCCGAG": 1257,
      "TGGACA": 1258,
      "CGGATCG": 1259,
      "ATCTAA": 1260,
      "ATAATAA": 1261,
      "CGCGCAG": 1262,
      "CTTTCC": 1263,
      "CGGCAGG": 1264,
      "AAGTCA": 1265,
      "ATTTCT": 1266,
      "CGGCCTG": 1267,
      "TAGCCA": 1268,
      "TCGGTT": 1269,
      "TATCAG": 1270,
      "CGCGCCA": 1271,
      "CCCGAGG": 1272,
      "TAATCG": 1273,
      "CGGCGCCG": 1274,
      "ATGAAAA": 1275,
      "CCTCCCG": 1276,
      "ACGGTT": 1277,
      "ATCATCA": 1278,
      "CCGCGAA": 1279,
      "TCAGTT": 1280,
      "ACTCTG": 1281,
      "AAATATT": 1282,
      "CACGTT": 1283,
      "ACCGTT": 1284,
      "ATCGCCA": 1285,
      "CTCGGGG": 1286,
      "CATTAA": 1287,
      "CAGACA": 1288,
      "TTTGTG": 1289,
      "TCCGCCG": 1290,
      "ATAGTT": 1291,
      "CTCATCG": 1292,
      "CAAAATT": 1293,
      "CTTGTG": 1294,
      "TAATGG": 1295,
      "CTCAGCG": 1296,
      "CTGACA": 1297,
      "CCAGCGCG": 1298,
      "TATAAAA": 1299,
      "CCTGGGG": 1300,
      "TCCAGGG": 1301,
      "CTGTCA": 1302,
      "CCGCGCCG": 1303,
      "AAGGGCG": 1304,
      "CCCGCGCG": 1305,
      "TATACA": 1306,
      "TATTTTTT": 1307,
      "TCTGTT": 1308,
      "ACTATG": 1309,
      "ACGACC": 1310,
      "ATCTGCG": 1311,
      "CGGCGTCG": 1312,
      "TTCGCCG": 1313,
      "TAGCAG": 1314,
      "CCTGCCG": 1315,
      "CAAGTG": 1316,
      "CTCCCGG": 1317,
      "ATTGTG": 1318,
      "CTCGGCA": 1319,
      "CTGCCCG": 1320,
      "ACGGCCG": 1321,
      "CGGGCGCG": 1322,
      "CCGGCGAG": 1323,
      "CTCGCCA": 1324,
      "TCTATG": 1325,
      "TGAATG": 1326,
      "TCGGCCA": 1327,
      "CTCCGGG": 1328,
      "ACCCGCG": 1329,
      "CGGCAAG": 1330,
      "AACGCA": 1331,
      "AAGTAG": 1332,
      "TTCGTT": 1333,
      "TGGGTT": 1334,
      "AAGCTT": 1335,
      "CCGGACG": 1336,
      "ACCGGGG": 1337,
      "CCCGCCA": 1338,
      "TTGTGG": 1339,
      "CTTCTCG": 1340,
      "AGGGTT": 1341,
      "CCCCTGG": 1342,
      "AATTAG": 1343,
      "TTTTTCA": 1344,
      "CTTTTTG": 1345,
      "ATTCTG": 1346,
      "AGCGTT": 1347,
      "ACAGTT": 1348,
      "CACACA": 1349,
      "ATGTAA": 1350,
      "TATGAG": 1351,
      "TCCGTT": 1352,
      "TACGGCG": 1353,
      "TACATT": 1354,
      "CCGATCG": 1355,
      "ATCTTTT": 1356,
      "TTTTATT": 1357,
      "TGCAGG": 1358,
      "AAACG": 1359,
      "CTGCAGG": 1360,
      "TTCACA": 1361,
      "CTTCTTG": 1362,
      "TAGTGG": 1363,
      "TCCTCT": 1364,
      "CCAGGGG": 1365,
      "CCCCGAG": 1366,
      "TCGCGCG": 1367,
      "CAGTCA": 1368,
      "CAGCGGG": 1369,
      "CCAGGAG": 1370,
      "CTCACA": 1371,
      "TAAGAG": 1372,
      "ACATAA": 1373,
      "AACGG": 1374,
      "TACTTG": 1375,
      "ATGTAG": 1376,
      "CTTCCTG": 1377,
      "CCGGCCGG": 1378,
      "CCTTGGG": 1379,
      "ATCAGCA": 1380,
      "ATGCTT": 1381,
      "GGGCG": 1382,
      "TATCGG": 1383,
      "TACCTG": 1384,
      "CCGCCTG": 1385,
      "ATGGCGG": 1386,
      "ATTTAG": 1387,
      "TTGTCA": 1388,
      "CCGACCG": 1389,
      "CTAGAA": 1390,
      "CAGCCCG": 1391,
      "CCGCGGG": 1392,
      "ACACGG": 1393,
      "CTGCGGG": 1394,
      "TTCGTCG": 1395,
      "CAGATCG": 1396,
      "AATGTT": 1397,
      "CTTCCAG": 1398,
      "ATTTTAA": 1399,
      "CTGGAGG": 1400,
      "TTGTAG": 1401,
      "TGGCGCG": 1402,
      "TTGTAA": 1403,
      "CCGTCGG": 1404,
      "CTGGAAG": 1405,
      "CTGACCG": 1406,
      "CCACCAG": 1407,
      "AAAATCA": 1408,
      "CATGTG": 1409,
      "CCACCGG": 1410,
      "TCCTGCG": 1411,
      "CCCGGCA": 1412,
      "AAAAACA": 1413,
      "ACCCTT": 1414,
      "ACTGTT": 1415,
      "TGGCTT": 1416,
      "TATTATT": 1417,
      "ACTCAG": 1418,
      "CCACTT": 1419,
      "CGCGAAG": 1420,
      "CGGCGCGG": 1421,
      "CAGGAAG": 1422,
      "TAAGTT": 1423,
      "CTCCTTG": 1424,
      "AATGCA": 1425,
      "AACGTG": 1426,
      "ACGACGG": 1427,
      "ATTCAG": 1428,
      "ACCTTCG": 1429,
      "TCGCGCA": 1430,
      "ATTCCG": 1431,
      "ACGCGCG": 1432,
      "TACATG": 1433,
      "CCATAA": 1434,
      "ACTGGCG": 1435,
      "TCGTAG": 1436,
      "CAAAAAG": 1437,
      "CCTGGAG": 1438,
      "ATCTAG": 1439,
      "ATAGGG": 1440,
      "CCGGAGG": 1441,
      "ACCTGGG": 1442,
      "CTGCGCA": 1443,
      "TAGGTG": 1444,
      "CGGCGAGG": 1445,
      "CTGGACG": 1446,
      "TCAGTG": 1447,
      "CATTAG": 1448,
      "CCGTAG": 1449,
      "ATTGGCG": 1450,
      "ACTACT": 1451,
      "TTGCTT": 1452,
      "CTGGCCA": 1453,
      "CCGTCC": 1454,
      "CGGCCGCG": 1455,
      "TAGGAA": 1456,
      "AAAAATG": 1457,
      "CTCAAGG": 1458,
      "CTCCACG": 1459,
      "CCGGGCA": 1460,
      "CCGGGAG": 1461,
      "ACTTAA": 1462,
      "ATCTTCA": 1463,
      "ATTACA": 1464,
      "CACGATG": 1465,
      "CAGCCAG": 1466,
      "TCGTCGG": 1467,
      "TATGTT": 1468,
      "CAGCTTG": 1469,
      "CACGCTG": 1470,
      "ATTTCC": 1471,
      "CGGGCTG": 1472,
      "ACGATCG": 1473,
      "CTGGCTG": 1474,
      "CGCGCTCG": 1475,
      "ATCTGGG": 1476,
      "TCTGGCG": 1477,
      "TACGAA": 1478,
      "CAAGAAG": 1479,
      "ATCCGCA": 1480,
      "ATCAGGG": 1481,
      "ATTCGG": 1482,
      "CGGGTGG": 1483,
      "AGGTAG": 1484,
      "CCATCGG": 1485,
      "CCCCGCCG": 1486,
      "TTCGACG": 1487,
      "ATGCCGG": 1488,
      "ATCGGGG": 1489,
      "TGGGGCG": 1490,
      "TTCATCA": 1491,
      "ATTTCTT": 1492,
      "CTCGACA": 1493,
      "TCCCTT": 1494,
      "TATCCG": 1495,
      "CCCGCTG": 1496,
      "TCAGGCG": 1497,
      "CCCCGGCG": 1498,
      "TCTCAG": 1499,
      "CGGTAG": 1500,
      "CCCGGAG": 1501,
      "CGGGCAG": 1502,
      "CCGCGGCG": 1503,
      "CAGCGCA": 1504,
      "ACCGGCA": 1505,
      "TCCGGGG": 1506,
      "ACAGTG": 1507,
      "ACCGCGG": 1508,
      "CCCATCG": 1509,
      "CTAAAT": 1510,
      "ACCGTCG": 1511,
      "TTGACA": 1512,
      "ACGAGCG": 1513,
      "ATTTTTG": 1514,
      "CCAGGGCG": 1515,
      "CCGGTCA": 1516,
      "CCAACT": 1517,
      "TATGCA": 1518,
      "CAGGTGG": 1519,
      "TATTTAA": 1520,
      "CCTACC": 1521,
      "ATCGTCA": 1522,
      "CCAACC": 1523,
      "AACTG": 1524,
      "ATGGTGG": 1525,
      "AAAAAATT": 1526,
      "CTCGCTG": 1527,
      "CGGTCGG": 1528,
      "ATTATG": 1529,
      "TCTGTG": 1530,
      "ATGGCCG": 1531,
      "AAAATAT": 1532,
      "CCCCACG": 1533,
      "TCATAA": 1534,
      "CTAACA": 1535,
      "ATCAAGG": 1536,
      "CTTTCTT": 1537,
      "ATCCTCA": 1538,
      "CCTTGAG": 1539,
      "TGTGCA": 1540,
      "CTAGCG": 1541,
      "CCATAG": 1542,
      "TCGGGGG": 1543,
      "TGCGTT": 1544,
      "ACCTAA": 1545,
      "CAGGAGG": 1546,
      "CTAGAG": 1547,
      "TCGGCGAG": 1548,
      "TGTGAG": 1549,
      "TATTTTG": 1550,
      "CCTACT": 1551,
      "CAGGATG": 1552,
      "TCGGCGCG": 1553,
      "AAAATTG": 1554,
      "AACCA": 1555,
      "CTCATCA": 1556,
      "CTGGATG": 1557,
      "TAAGCA": 1558,
      "TTGGGCG": 1559,
      "ACATCT": 1560,
      "CAAATAA": 1561,
      "AGGTAA": 1562,
      "CTATAG": 1563,
      "TTCATCG": 1564,
      "CGGCGATG": 1565,
      "CCCGCAG": 1566,
      "CTCCCT": 1567,
      "CTGCACG": 1568,
      "CAGGACG": 1569,
      "CTATCT": 1570,
      "TGGTAA": 1571,
      "ACGGTCG": 1572,
      "CTGGGGG": 1573,
      "TCATCT": 1574,
      "CCGGGGCG": 1575,
      "TAGGCA": 1576,
      "ACCGACG": 1577,
      "CCACGCG": 1578,
      "CTCCTCC": 1579,
      "ATCGAAG": 1580,
      "ATCCCT": 1581,
      "CCTGCGCG": 1582,
      "TACTCA": 1583,
      "CTGTAA": 1584,
      "ACCATCG": 1585,
      "TATAAG": 1586,
      "ATTTATT": 1587,
      "TCGGTGG": 1588,
      "TGCCCG": 1589,
      "CTTCAAG": 1590,
      "TCTTAA": 1591,
      "CCTGCTCG": 1592,
      "AAGGCGG": 1593,
      "ATCGATG": 1594,
      "CCTGCAG": 1595,
      "CTTCGGG": 1596,
      "TACACA": 1597,
      "AGCGTCG": 1598,
      "TAGTCA": 1599,
      "CTCTAG": 1600,
      "TTCGAGG": 1601,
      "CCTAAG": 1602,
      "CTTGATG": 1603,
      "ATCAACA": 1604,
      "CGGTGCG": 1605,
      "TCGGTCG": 1606,
      "CTGACC": 1607,
      "CGCGCCGG": 1608,
      "CCCCCAG": 1609,
      "ACCGAGG": 1610,
      "TACCTT": 1611,
      "TAGACA": 1612,
      "ATCAATT": 1613,
      "CTCGTGG": 1614,
      "CCTCACG": 1615,
      "ACGCTT": 1616,
      "CCCGATG": 1617,
      "CCTGCGG": 1618,
      "ATCACCG": 1619,
      "CAGTAA": 1620,
      "ATCGACA": 1621,
      "CACGAGG": 1622,
      "CGGCGTT": 1623,
      "AAAGTG": 1624,
      "CACGCGG": 1625,
      "CCGCAGG": 1626,
      "ACCTTGG": 1627,
      "CTAAGG": 1628,
      "CCGGAAG": 1629,
      "CTGTAG": 1630,
      "CCAGAAG": 1631,
      "CCCGAAG": 1632,
      "CTTGAAG": 1633,
      "AGAAATT": 1634,
      "CTGGTCA": 1635,
      "ACATCC": 1636,
      "TACCAGG": 1637,
      "CTAACG": 1638,
      "CCGGCGGCG": 1639,
      "ACGGTGG": 1640,
      "AACCG": 1641,
      "ACCGCCA": 1642,
      "CTCTGCG": 1643,
      "TGCGGG": 1644,
      "AGGCTT": 1645,
      "AGAGTT": 1646,
      "CCTCTCG": 1647,
      "ATCGGTG": 1648,
      "CCGCCGCCG": 1649,
      "ACAGGCG": 1650,
      "ATCCACG": 1651,
      "TCGATCG": 1652,
      "CTCACCG": 1653,
      "TGAGTT": 1654,
      "TCGACC": 1655,
      "CTAGCA": 1656,
      "CCAGCCA": 1657,
      "ACGCTCG": 1658,
      "CTCGCGCG": 1659,
      "CACGAAG": 1660,
      "TCTCGCG": 1661,
      "CCCCCCG": 1662,
      "CTTACA": 1663,
      "CAGCGTG": 1664,
      "ACCAGCA": 1665,
      "CAAGCTG": 1666,
      "CCCAGCA": 1667,
      "ATGCGCG": 1668,
      "TCCCGCG": 1669,
      "ACTTAG": 1670,
      "ATCGTGG": 1671,
      "CTCCCCG": 1672,
      "CTCGGAG": 1673,
      "TACCCA": 1674,
      "TATCAAA": 1675,
      "ACCATCA": 1676,
      "CCTGGGCG": 1677,
      "CAGTAG": 1678,
      "ATCACCA": 1679,
      "TACGCA": 1680,
      "CTTCACG": 1681,
      "CCGGCGGG": 1682,
      "CCGCGACG": 1683,
      "ATCCCCG": 1684,
      "CTATTTT": 1685,
      "TGTGTG": 1686,
      "ATCTCGG": 1687,
      "ATTGAAG": 1688,
      "CCTTAG": 1689,
      "TATAATT": 1690,
      "CTTCTGG": 1691,
      "CCTCAAG": 1692,
      "CTGATGG": 1693,
      "TCCTTGG": 1694,
      "TAATATT": 1695,
      "TGCGCCG": 1696,
      "CCGGATG": 1697,
      "ACGGCCA": 1698,
      "ACCTGCA": 1699,
      "CTTCAAA": 1700,
      "CCTTAA": 1701,
      "CGGGACG": 1702,
      "TAAATAA": 1703,
      "ATTGATG": 1704,
      "CATGCCG": 1705,
      "CTCGTCA": 1706,
      "CTTGTCG": 1707,
      "TTGAAAA": 1708,
      "CCAAAAA": 1709,
      "TGATGG": 1710,
      "CCCGGGCG": 1711,
      "CCTCGAA": 1712,
      "ACAACT": 1713,
      "AGCGCCA": 1714,
      "TCCTTCG": 1715,
      "TGGTAG": 1716,
      "CTTCAGG": 1717,
      "CGGGGGG": 1718,
      "TCCGCCA": 1719,
      "CCAGGAA": 1720,
      "CGGCGCTG": 1721,
      "TAAACG": 1722,
      "CCTTCGG": 1723,
      "AAGAAGG": 1724,
      "CAGCTGG": 1725,
      "CCGATGG": 1726,
      "ATATATT": 1727,
      "ACCTTCA": 1728,
      "CCTCTGG": 1729,
      "CCAGTCG": 1730,
      "CTTCATG": 1731,
      "CAAAACA": 1732,
      "CCCCTTG": 1733,
      "TACGTG": 1734,
      "CAGGTTG": 1735,
      "TAACCA": 1736,
      "AGCGACG": 1737,
      "TACCGCG": 1738,
      "TAACTT": 1739,
      "CGCGTGG": 1740,
      "ACTGTG": 1741,
      "AGCGAGG": 1742,
      "CTTGCGG": 1743,
      "ATTTTAG": 1744,
      "CTTCCGG": 1745,
      "CGGGAAG": 1746,
      "CAGCAAG": 1747,
      "CTGTTCG": 1748,
      "TCAAAAA": 1749,
      "CTTCCCG": 1750,
      "CTCTAA": 1751,
      "TATTGAA": 1752,
      "CCGCGTCG": 1753,
      "TCCGCGG": 1754,
      "CGGGGAG": 1755,
      "TAGAAAA": 1756,
      "ACGGCGCG": 1757,
      "ATGGTCG": 1758,
      "ACGCGCA": 1759,
      "CCGTCT": 1760,
      "CTGAAGG": 1761,
      "CCGGGAA": 1762,
      "TGGCCGG": 1763,
      "CAGCATG": 1764,
      "TCCATCG": 1765,
      "CTGGGAG": 1766,
      "AGCATCG": 1767,
      "CTTATG": 1768,
      "ATAAAAG": 1769,
      "TAGGTT": 1770,
      "ATTAAAA": 1771,
      "ACGTAG": 1772,
      "CCCTTCA": 1773,
      "CTAGTT": 1774,
      "CTCTTCA": 1775,
      "CTTGTTG": 1776,
      "TGGGCGG": 1777,
      "ACACTG": 1778,
      "CGGGATG": 1779,
      "CGGGCGAG": 1780,
      "CTCGCCGG": 1781,
      "CCCCTCC": 1782,
      "CTTGGGG": 1783,
      "CGGCATCG": 1784,
      "TTTTCTT": 1785,
      "CTCCTCA": 1786,
      "TCATCC": 1787,
      "TGCGCGG": 1788,
      "TTCGCGG": 1789,
      "CTCCCAG": 1790,
      "TCGCGAA": 1791,
      "CCCACCA": 1792,
      "CTCTTTT": 1793,
      "CAAGCCG": 1794,
      "CCTGAAG": 1795,
      "CCTCGACG": 1796,
      "ACCACCA": 1797,
      "CAAAATG": 1798,
      "TATTTCA": 1799,
      "ATCAAAG": 1800,
      "CAGGCTG": 1801,
      "ATCATGG": 1802,
      "CCAGTTG": 1803,
      "CCCATCA": 1804,
      "CCTCGTCG": 1805,
      "TCTTGAA": 1806,
      "TCCATCA": 1807,
      "ACGGCGAG": 1808,
      "ACGCTGG": 1809,
      "ACCTCCG": 1810,
      "CATGATG": 1811,
      "CCGCACG": 1812,
      "TGACCG": 1813,
      "ATCCTTG": 1814,
      "TCCTGCA": 1815,
      "ACATAG": 1816,
      "TTGGTGG": 1817,
      "CCAGATG": 1818,
      "CAGCCTG": 1819,
      "ACCTAT": 1820,
      "ACCCGCA": 1821,
      "ATTGATT": 1822,
      "AAAAAGG": 1823,
      "CCCGTGG": 1824,
      "AAGGTCG": 1825,
      "CGGGCCA": 1826,
      "ATCAACG": 1827,
      "TCTTAG": 1828,
      "ATTGTTG": 1829,
      "TGTGTGTG": 1830,
      "ATAATTTT": 1831,
      "ACGGGGG": 1832,
      "CCAGCTG": 1833,
      "CTTGCTG": 1834,
      "AGGGCGG": 1835,
      "CATGAAG": 1836,
      "TTGGCGG": 1837,
      "AGGGGCG": 1838,
      "TATGTG": 1839,
      "TCCTCCG": 1840,
      "CTCAACG": 1841,
      "ATTTTCA": 1842,
      "CACACACA": 1843,
      "AGGCGCG": 1844,
      "TTCTCG": 1845,
      "ACCCCGG": 1846,
      "TCCTGGG": 1847,
      "AAGGCCG": 1848,
      "TGTTAA": 1849,
      "TGAGCG": 1850,
      "CCCGCCGG": 1851,
      "TACTAA": 1852,
      "CAGGCCA": 1853,
      "TTTTTGG": 1854,
      "ACCTGAA": 1855,
      "TCCTCCA": 1856,
      "CTGGCAG": 1857,
      "CTTGAGG": 1858,
      "TTGCCGG": 1859,
      "CCCCCTG": 1860,
      "CTTTGCG": 1861,
      "CCTAGG": 1862,
      "ACGACCG": 1863,
      "CAGGGGG": 1864,
      "CTCTGGG": 1865,
      "ATAGTG": 1866,
      "ATGATGG": 1867,
      "TATAGG": 1868,
      "CCGACT": 1869,
      "ACGATGG": 1870,
      "CAAATCA": 1871,
      "ACCTTTT": 1872,
      "TCAGCAG": 1873,
      "CGGGAGG": 1874,
      "CCTTGGCG": 1875,
      "CAAATTG": 1876,
      "CCGGCTCG": 1877,
      "TCGGTCA": 1878,
      "TCCAGCA": 1879,
      "CTCGGTG": 1880,
      "AAGGGGG": 1881,
      "TGGCGAA": 1882,
      "ACACAG": 1883,
      "CCTGATG": 1884,
      "TCCGGCA": 1885,
      "TGGCGCA": 1886,
      "CTGGTTG": 1887,
      "CCGCGTG": 1888,
      "CTTTTGG": 1889,
      "TCCTTCA": 1890,
      "TCCGTCG": 1891,
      "ACTGGGG": 1892,
      "ACATTTT": 1893,
      "ACGGCAG": 1894,
      "CCGGCCAG": 1895,
      "AGAAAAG": 1896,
      "CAAGCAG": 1897,
      "ATTTGAA": 1898,
      "CTCCGAG": 1899,
      "CTCAGCA": 1900,
      "ATCGCGCG": 1901,
      "TGTGTT": 1902,
      "CGGGTTG": 1903,
      "ATAAAAAA": 1904,
      "TCCACCA": 1905,
      "TACCGGG": 1906,
      "ACTTGAA": 1907,
      "CGGTCT": 1908,
      "CCGCGTT": 1909,
      "CGCGAGCG": 1910,
      "TAGCTT": 1911,
      "CCCTTGG": 1912,
      "CCTGGAA": 1913,
      "AAGGTGG": 1914,
      "TCCTAA": 1915,
      "TCTTTTG": 1916,
      "CGGCGAAG": 1917,
      "AAAATTTT": 1918,
      "ATTACG": 1919,
      "TCGGCAG": 1920,
      "CCCAGGCG": 1921,
      "TCAGCGG": 1922,
      "ATGATCG": 1923,
      "CTTTTCG": 1924,
      "TCACTG": 1925,
      "ATACCGG": 1926,
      "CTATAT": 1927,
      "TGTAA": 1928,
      "CCTCGCCG": 1929,
      "ACCTCTT": 1930,
      "CCTCCGCG": 1931,
      "TGTTAG": 1932,
      "CGGCGGAG": 1933,
      "TCTGGGG": 1934,
      "CTGGGCA": 1935,
      "TCGACGG": 1936,
      "AGGGGGG": 1937,
      "AATTTCA": 1938,
      "ATGGAAG": 1939,
      "CTGCTTG": 1940,
      "CTCGAGCG": 1941,
      "CCGCGCGG": 1942,
      "TGGCGAG": 1943,
      "TTCGCCA": 1944,
      "ATCCAAA": 1945,
      "AAGGAAG": 1946,
      "CCGGTTG": 1947,
      "AGTTAA": 1948,
      "CTCCT": 1949,
      "TCTTCTT": 1950,
      "ACGCCCG": 1951,
      "AACGTT": 1952,
      "ATGGCCA": 1953,
      "CCGGCACG": 1954,
      "CTCAACA": 1955,
      "TCCTGAA": 1956,
      "CCAGCAGG": 1957,
      "CATGTCG": 1958,
      "CTCACCA": 1959,
      "CTGGCGCG": 1960,
      "AATGTG": 1961,
      "AAGGAGG": 1962,
      "ATTGCCG": 1963,
      "CCTTCTT": 1964,
      "TCCTTTT": 1965,
      "CCCACCG": 1966,
      "TCTCGAG": 1967,
      "CCAGCTCG": 1968,
      "ACCCGGG": 1969,
      "CCGCGCTG": 1970,
      "AAAATGG": 1971,
      "AGCATCA": 1972,
      "AATTTTG": 1973,
      "CCTTCAG": 1974,
      "CACGCCA": 1975,
      "ACCGTCA": 1976,
      "CCCTTTT": 1977,
      "TACTAG": 1978,
      "CTTACG": 1979,
      "AATTTAA": 1980,
      "ATTAAG": 1981,
      "TTTTTAT": 1982,
      "ATCTTGG": 1983,
      "CGAGTT": 1984,
      "CTTTATT": 1985,
      "AAAATATT": 1986,
      "CCGTTCG": 1987,
      "CTCAGGG": 1988,
      "AAATTAA": 1989,
      "CCCAAGG": 1990,
      "CTCGTTG": 1991,
      "ACCTCCA": 1992,
      "CTACCGG": 1993,
      "ATCAATG": 1994,
      "ACGGTCA": 1995,
      "CGGCATG": 1996,
      "CCCTAG": 1997,
      "CAGGTCA": 1998,
      "CGGTAA": 1999,
      "CCCTAA": 2000,
      "CCTTCCA": 2001,
      "CCAGACG": 2002,
      "TCTCCGG": 2003,
      "CTCCGCCG": 2004,
      "TCTACT": 2005,
      "TTTGTTG": 2006,
      "CTTTCCG": 2007,
      "CAAGATG": 2008,
      "CTCCGCA": 2009,
      "TGGGGGG": 2010,
      "AAAAATAA": 2011,
      "CAAATCG": 2012,
      "CTTTGAA": 2013,
      "TCGGGCA": 2014,
      "CCAGCACG": 2015,
      "CCTGCCA": 2016,
      "TCCCCGG": 2017,
      "TACAGCG": 2018,
      "CCGTCCG": 2019,
      "TGAGTG": 2020,
      "CTCATGG": 2021,
      "ACCGTGG": 2022,
      "ATTTTGG": 2023,
      "AAGCGCG": 2024,
      "CAGGCAG": 2025,
      "ATGGAGG": 2026,
      "CAAAAGG": 2027,
      "TCCTCTT": 2028,
      "TCATAG": 2029,
      "CCTGACG": 2030,
      "TACTTCG": 2031,
      "CTCCGGCG": 2032,
      "TCGCCCG": 2033,
      "CCTTTTG": 2034,
      "CCCTGCA": 2035,
      "CCCGGTG": 2036,
      "AAAGAAG": 2037,
      "ACCAAGG": 2038,
      "CAAATGG": 2039,
      "CTGCCAG": 2040,
      "CATTTTG": 2041,
      "CAGCGAA": 2042,
      "CCCCT": 2043,
      "CCCATGG": 2044,
      "AAGGCCA": 2045,
      "AGTTAG": 2046,
      "CGGCTTG": 2047,
      "CGGGGGCG": 2048,
      "ACAGCAG": 2049,
      "CTGCGAG": 2050,
      "AGAGTG": 2051,
      "CTCGACC": 2052,
      "ATCGGCGG": 2053,
      "ATCCCAG": 2054,
      "TAAAAAT": 2055,
      "CTGACGG": 2056,
      "TTTGATG": 2057,
      "TTCCTG": 2058,
      "CCGAGCA": 2059,
      "CGGAGCG": 2060,
      "TTTGAAG": 2061,
      "CGCGTTG": 2062,
      "CTAGGG": 2063,
      "CTCAAAG": 2064,
      "ACAACC": 2065,
      "CCGTGCG": 2066,
      "CTTTCTG": 2067,
      "CCACGAA": 2068,
      "CCCGGAA": 2069,
      "TCGAGCA": 2070,
      "ACATAT": 2071,
      "CTACGCG": 2072,
      "CAGAAAA": 2073,
      "ACGTCGG": 2074,
      "ATGGGGG": 2075,
      "TTTGATT": 2076,
      "CTTCGGCG": 2077,
      "CTTGCCA": 2078,
      "ACATCGG": 2079,
      "CCGAAGG": 2080,
      "TCATCGG": 2081,
      "CCGAACG": 2082,
      "TCTTGCG": 2083,
      "AGGCCGG": 2084,
      "CTTTTCA": 2085,
      "CGCGATCG": 2086,
      "CTTTCCA": 2087,
      "TAGTTTT": 2088,
      "TTCACG": 2089,
      "ACCCTGG": 2090,
      "ACGACT": 2091,
      "ATCTCCA": 2092,
      "CAGTTCG": 2093,
      "ATAATTG": 2094,
      "CCTGTCG": 2095,
      "ATCATTG": 2096,
      "CTGAGCG": 2097,
      "ATCCGGCG": 2098,
      "ACTAAG": 2099,
      "TTCGGG": 2100,
      "CCATCCG": 2101,
      "CGCGCGAG": 2102,
      "AATTATT": 2103,
      "CTCCCC": 2104,
      "ACTTTTG": 2105,
      "ATGGTCA": 2106,
      "CATGCTG": 2107,
      "TAACTG": 2108,
      "CCTGTTG": 2109,
      "AAGGTCA": 2110,
      "CCAGTGG": 2111,
      "CTTAAG": 2112,
      "CTTGACG": 2113,
      "ATAATCA": 2114,
      "TGACGG": 2115,
      "CCGGCCCG": 2116,
      "ATACAAA": 2117,
      "AAATTCG": 2118,
      "CCATCAG": 2119,
      "CCAGGCA": 2120,
      "TGCTAG": 2121,
      "CCGAGGG": 2122,
      "CGGACGG": 2123,
      "TCTAAAA": 2124,
      "CTTTTAA": 2125,
      "CCTTTGG": 2126,
      "CAGGGCA": 2127,
      "CACGTTG": 2128,
      "ACTAAAA": 2129,
      "AGCGTGG": 2130,
      "ATGTTTT": 2131,
      "ATATTAA": 2132,
      "CAAGACG": 2133,
      "CCGACCA": 2134,
      "ACCCAGG": 2135,
      "AGGCGCA": 2136,
      "CAAGCGG": 2137,
      "TGGGTGG": 2138,
      "CTGGCCGG": 2139,
      "ACCGGAG": 2140,
      "CCGTAA": 2141,
      "ATATTCG": 2142,
      "TCTTTCA": 2143,
      "TACGTT": 2144,
      "ACCTGCTG": 2145,
      "ACTCGCG": 2146,
      "CCATTTT": 2147,
      "TTCAAGG": 2148,
      "TTCGATG": 2149,
      "CAGCAGCG": 2150,
      "CCCTGGCG": 2151,
      "CCCGACA": 2152,
      "CCGCCGCA": 2153,
      "TAAGTG": 2154,
      "CGGTCC": 2155,
      "CCATAT": 2156,
      "ATATATAT": 2157,
      "CCAGCCGG": 2158,
      "TCCGACG": 2159,
      "CCTTGAA": 2160,
      "TCGTCC": 2161,
      "CTTTCAG": 2162,
      "ATTGCTG": 2163,
      "TCGGCGGCG": 2164,
      "TTGGGGG": 2165,
      "CTACCAG": 2166,
      "CCCGTCA": 2167,
      "ATCCCCA": 2168,
      "TCGATGG": 2169,
      "TTCAACA": 2170,
      "ATTGGGG": 2171,
      "CGGCGGCGG": 2172,
      "ACCGATG": 2173,
      "ACCGAAG": 2174,
      "TTCGTCA": 2175,
      "TGCACG": 2176,
      "CTCGCAG": 2177,
      "TCTAAG": 2178,
      "CATGACG": 2179,
      "AAAATAG": 2180,
      "CCCCTCA": 2181,
      "ACCTTTG": 2182,
      "AGCAAGG": 2183,
      "CTCCCTG": 2184,
      "ACCTGTT": 2185,
      "CAGGTAG": 2186,
      "CCCCAAG": 2187,
      "CCGCGATG": 2188,
      "TGAAGG": 2189,
      "TGAAATT": 2190,
      "ATAATAT": 2191,
      "TCTCCAG": 2192,
      "CGGCGTGG": 2193,
